/*
 * Copyright (C) 2012 Maxim Integrated Product
 * Jayden Cha <jayden.cha@maxim-ic.com>
 * Copyright 2012-2014 Amazon Technologies, Inc.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, version 2.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
 */

#ifndef __MAX77696_H__
#define __MAX77696_H__

#include <linux/kernel.h>
#include <linux/leds.h>
#include <linux/power_supply.h>
#include <linux/regulator/machine.h>

#define MAX77696_DRIVER_VERSION            "1.0"

#define MAX77696_I2C_ADDR                  (0x78>>1)

#define MAX77696_NAME                      "max77696"
#define MAX77696_CORE_NAME                 MAX77696_NAME"-core"
#define MAX77696_IRQ_NAME                  MAX77696_NAME"-irq"
#define MAX77696_TOPSYS_NAME               MAX77696_NAME"-topsys"
#define MAX77696_GPIO_NAME                 MAX77696_NAME"-gpio"
#define MAX77696_32K_NAME                  MAX77696_NAME"-32k"

#define MAX77696_GAUGE_NAME                MAX77696_NAME"-battery"
#define MAX77696_CHARGER_NAME              MAX77696_NAME"-charger"
#define MAX77696_EH_NAME                   MAX77696_NAME"-eh"
#define MAX77696_ONKEY_NAME                MAX77696_NAME"-onkey"

/* MAX77696 Module ID */
#define MAX77696_CORE_MID                  0
#define MAX77696_IRQ_MID                   MAX77696_CORE_MID
#define MAX77696_TOPSYS_MID                MAX77696_CORE_MID
#define MAX77696_GPIO_MID                  MAX77696_CORE_MID
#define MAX77696_32K_MID                   MAX77696_CORE_MID
#define MAX77696_WDT_MID                   MAX77696_CORE_MID
#define MAX77696_RTC_MID                   1
#define MAX77696_BUCK_MID                  MAX77696_CORE_MID
#define MAX77696_LDO_MID                   MAX77696_CORE_MID
#define MAX77696_LSW_MID                   MAX77696_CORE_MID
#define MAX77696_VDDQ_MID                  MAX77696_CORE_MID
#define MAX77696_LEDS_MID                  MAX77696_CORE_MID
#define MAX77696_BL_MID                    MAX77696_CORE_MID
#define MAX77696_ADC_MID                   MAX77696_CORE_MID
#define MAX77696_UIC_MID                   2
#define MAX77696_GAUGE_MID                 3
#define MAX77696_CHARGER_MID               MAX77696_CORE_MID
#define MAX77696_EH_MID                    MAX77696_RTC_MID
#define MAX77696_ONKEY_MID                 MAX77696_CORE_MID

/* Names of power supplies
 */

/* Fuel Gauge */
#define MAX77696_PSY_BATT_NAME             MAX77696_GAUGE_NAME
/* Main Battery Charger */
#define MAX77696_PSY_CHG_NAME              MAX77696_CHARGER_NAME
/* Energy Harvester */
#define MAX77696_PSY_EH_NAME               MAX77696_EH_NAME

/* Number of interrupts to be reserved for MAX77696 */
#define MAX77696_GPIO_IRQ_OFFSET           \
	(MAX77696_ROOTINT_NR_IRQS + MAX77696_TOPSYSINT_NR_IRQS)
#define MAX77696_NR_IRQS                   \
	(MAX77696_GPIO_IRQ_OFFSET + MAX77696_GPIO_NR_GPIOS)

/* 32kHz OSC load capacitance selection */
#define MAX77696_32K_LOAD_CAP_22PF         0 /* 22pF per node */
#define MAX77696_32K_LOAD_CAP_12PF         1 /* 12pF per node */
#define MAX77696_32K_LOAD_CAP_10PF         2 /* 10pF per node */
#define MAX77696_32K_LOAD_CAP_NONE         3 /* No internal load cap selected */

/* 32kHz OSC operation mode
 *   Whenever the main battery is plugged in and VSYS > VSYSMIN, and the
 *   MODE_SEL bit is set to 1, the crystal driver goes into a high current, high
 *   accuracy state that meets the 15ns cycle by cycle jitter and 45%. 55% duty
 *   cycle spec. As soon as VSYS < VSYSMIN, the oscillator automatically goes
 *   into a low power state where it does not meet the jitter and duty cycle
 *   specification. The assumption is that when VSYS < VSYSMIN, the radio is
 *   off, and tight jitter and duty cycle spec is not required. This prevents
 *   the battery from being too deeply discharge, since the supply current is
 *   reduced.
 */
#define MAX77696_32K_MODE_LOW_POWER        0 /* Low Power */
#define MAX77696_32K_MODE_LOW_JITTER       1 /* Low Jitter */

struct max77696_32k_platform_data {
	int load_cap:2; /* 32kHz OSC load capacitance selection */
	int op_mode:1;  /* 32kHz OSC operation mode             */
};

/* Number of GPIOs */
#define MAX77696_GPIO_NR_GPIOS             5

/* GPIO alternate mode */
#define MAX77696_GPIO_AME_STDGPIO          0 /* Standard GPI or GPO */
#define MAX77696_GPIO_AME_MODE_0           1
#define MAX77696_GPIO_AME_MODE_1           2
#define MAX77696_GPIO_AME_MODE_2           3

/* GPIO direction */
#define MAX77696_GPIO_DIR_OUTPUT           0
#define MAX77696_GPIO_DIR_INPUT            1

/* GPIO output configuration */
#define MAX77696_GPIO_OUTCFG_OPENDRAIN     0
#define MAX77696_GPIO_OUTCFG_PUSHPULL      1

/* Debounce Configuration */
#define MAX77696_GPIO_DBNC_0_MSEC          0
#define MAX77696_GPIO_DBNC_8_MSEC          1
#define MAX77696_GPIO_DBNC_16_MSEC         2
#define MAX77696_GPIO_DBNC_32_MSEC         3

/* Rising edge and falling edge interrupt configuration */
#define MAX77696_GPIO_REFEIRQ_NONE         0x0
#define MAX77696_GPIO_REFEIRQ_FALLING      0x1
#define MAX77696_GPIO_REFEIRQ_RISING       0x2
#define MAX77696_GPIO_REFEIRQ_BOTH         \
	(MAX77696_GPIO_REFEIRQ_FALLING|MAX77696_GPIO_REFEIRQ_RISING)

struct max77696_gpio_init_data {
	int pin_connected:1;
	int alter_mode:2;    /* GPIO Alternate Mode Enable (see datasheet for details) */
	int pullup_en:1;     /* GPIO Pull-Up Enable */
	int pulldn_en:1;     /* GPIO Pull-Down Enable */
	int direction:1;
	union {
		struct {
			int out_cfg:1;  /* Output configuration */
			int drive:1;    /* Output drive level (0:LOW / 1:HIGH) */
		} output;
		struct {
			int debounce:2; /* Debounce configuration */
			int refe_irq:2; /* Rising and falling edge interrupt configuration */
		} input;
	} u;
};

struct max77696_gpio_platform_data {
	int                            irq_base;
	int                            gpio_base;
	int                            bias_en;  /* GPIO Biasing Circuitry Enable */
	struct max77696_gpio_init_data init_data[MAX77696_GPIO_NR_GPIOS];
};

struct max77696_watchdog_platform_data {
	unsigned int timeout_sec;
	unsigned int ping_interval_sec; /* If watchdog daemon is used,
									 * then set this zero.
									 */
};

struct max77696_rtc_platform_data {
	bool irq_1m; /* RTC 1 minute interrupt */
	bool irq_1s; /* RTC 1 second interrupt */
};

/* BUCK_ Rising Slew Rate Selection */
#define MAX77696_BUCK_RISING_SLEW_RATE_12p5_MV_PER_USEC  0b00
#define MAX77696_BUCK_RISING_SLEW_RATE_25_MV_PER_USEC    0b01
#define MAX77696_BUCK_RISING_SLEW_RATE_50_MV_PER_USEC    0b10
#define MAX77696_BUCK_RISING_SLEW_RATE_NO_CONTROL        0b11

/* BUCK_ Operating Mode Selection */
#define MAX77696_BUCK_OPERATING_MODE_OFF                 0b00
                              /* Disabled. BUCK_ is OFF. */
#define MAX77696_BUCK_OPERATING_MODE_DYNAMIC_STANDBY     0b01
                              /* Dynamic Standby Mode. BUCK_ operates in Normal
                               * Mode when the Standby Bus is Low and operates
                               * in Standby Mode when the Global Low Power Mode
                               * Bus is High.
                               */
#define MAX77696_BUCK_OPERATING_MODE_FORCED_STANDBY      0b10
                              /* Forced Standby Mode. BUCK_ operates in Standby
                               * Mode regardless of the state of the Global Low
                               * Power Mode Bus.
                               */
#define MAX77696_BUCK_OPERATING_MODE_NORMAL              0b11
                              /* Normal Operation. BUCK_ operates in Normal Mode
                               * regardless of the state of the Global Low Power
                               * Mode Bus.
                               */

/* Number of Buck Regulators */
#define MAX77696_BUCK_NR_REGS          MAX77696_BUCK_ID_MAX

enum {
    MAX77696_BUCK_ID_B1 = 0,
    MAX77696_BUCK_ID_B1DVS,
    MAX77696_BUCK_ID_B2,
    MAX77696_BUCK_ID_B2DVS,
    MAX77696_BUCK_ID_B3,
    MAX77696_BUCK_ID_B4,
    MAX77696_BUCK_ID_B5,
    MAX77696_BUCK_ID_B6,
    MAX77696_BUCK_ID_MAX,
};

struct max77696_buck_platform_data {
    bool                       support_suspend_ops;
    struct regulator_init_data init_data[MAX77696_BUCK_NR_REGS];
};

/* LDOx Power Mode */
#define MAX77696_LDO_POWERMODE_OFF                0b00
                              /* Output Disabled. OUTLDOxx is off. */
#define MAX77696_LDO_POWERMODE_LOW_POWER          0b01
                              /* Group Low-Power Mode. OUTLDOxx operates in
                               * normal mode when the global low-power mode
                               * signal is low. When the global low-power mode
                               * signal is high, OUTLDOxx operates in
                               * low-power mode.
                               */
#define MAX77696_LDO_POWERMODE_FORCED_LOW_POWER   0b10
                              /* Low-Power Mode. OUTLDOxx is forced into
                               * low-power mode. The maximum load current is
                               * 5mA and the quiescent supply current is 1.5uA.
                               */
#define MAX77696_LDO_POWERMODE_NORMAL             0b11
                              /* Normal Mode. OUTLDOxx is forced into its normal
                               * operating mode.
                               */

/* LDOx Transconductance Setting */
#define MAX77696_LDO_TRANSCONDUCTANCE_FAST        0b00
#define MAX77696_LDO_TRANSCONDUCTANCE_MEDIUM_FAST 0b01
#define MAX77696_LDO_TRANSCONDUCTANCE_MEDIUM_SLOW 0b10
#define MAX77696_LDO_TRANSCONDUCTANCE_SLOW        0b11

/* LDOx Soft-Start Slew Rate Configuration
 * (Applies to both start-up and output voltage setting changes)
 */
#define MAX77696_LDO_SLEW_RATE_FAST               0 /* 100mV / usec */
#define MAX77696_LDO_SLEW_RATE_SLOW               1 /*   5mV / usec */

/* LDO Current Monitor Operating Mode */
#define MAX77696_LDO_OPERATING_MODE_AUTONOMOUS    0
#define MAX77696_LDO_OPERATING_MODE_MANUAL_OFF    1
#define MAX77696_LDO_OPERATING_MODE_MANUAL_ON     2

/* Number of LDO Regulators */
#define MAX77696_LDO_NR_REGS           MAX77696_LDO_ID_MAX

enum {
    MAX77696_LDO_ID_L1 = 0,
    MAX77696_LDO_ID_L2,
    MAX77696_LDO_ID_L3,
    MAX77696_LDO_ID_L4,
    MAX77696_LDO_ID_L5,
    MAX77696_LDO_ID_L6,
    MAX77696_LDO_ID_L7,
    MAX77696_LDO_ID_L8,
    MAX77696_LDO_ID_L9,
    MAX77696_LDO_ID_L10,
    MAX77696_LDO_ID_MAX,
};

/* LDO Current Monitor Transfer Function. L_IMON_TF adjusts the monitor's
 * transfer function. This adjustment capability is very similar to the "range"
 * function on a digital multi-meter (DMM).
 */
#define MAX77696_LDO_IMON_TF_8000_OHM 0b000
#define MAX77696_LDO_IMON_TF_4000_OHM 0b001
#define MAX77696_LDO_IMON_TF_2000_OHM 0b010
#define MAX77696_LDO_IMON_TF_1000_OHM 0b011 /* device default */
#define MAX77696_LDO_IMON_TF_500_OHM  0b100
#define MAX77696_LDO_IMON_TF_250_OHM  0b101
#define MAX77696_LDO_IMON_TF_125_OHM  0b110
#define MAX77696_LDO_IMON_TF_62p5_OHM 0b111

struct max77696_ldo_platform_data {
    u8                         imon_tf; /* Current Monitor Transfer Function */
    struct regulator_init_data init_data[MAX77696_LDO_NR_REGS];
};

/* Load Switches */
#define MAX77696_LSW_NR_REGS           MAX77696_LSW_ID_MAX

enum {
    MAX77696_LSW_ID_LSW1 = 0,
    MAX77696_LSW_ID_LSW2,
    MAX77696_LSW_ID_LSW3,
    MAX77696_LSW_ID_LSW4,
    MAX77696_LSW_ID_MAX,
};

struct max77696_lsw_platform_data {
    struct regulator_init_data init_data[MAX77696_LSW_NR_REGS];
};

/* EPD Power Supplies */
#define MAX77696_EPD_NR_REGS           MAX77696_EPD_ID_MAX

/* EPD */
enum {
	MAX77696_EPD_ID_EPDEN = 0,
	MAX77696_EPD_ID_EPDVCOM,
	MAX77696_EPD_ID_EPDVEE,
	MAX77696_EPD_ID_EPDVNEG,
	MAX77696_EPD_ID_EPDVPOS,
	MAX77696_EPD_ID_EPDVDDH,
	MAX77696_EPD_ID_MAX,
};

struct max77696_epd_platform_data {
	struct regulator_init_data *init_data;
	int irq;
	int pwrgood_irq;
	int pwrgood_gpio;
};

/* LPDDR2 Termination Supply */
struct max77696_vddq_platform_data {
	int                        vddq_in_uV;
	struct regulator_init_data init_data;
};

enum {
	MAX77696_LED_GREEN = 0,
	MAX77696_LED_AMBER,

	MAX77696_LED_NR_LEDS,
};

enum {
	MAX77696_LED_OFF = 0,
	MAX77696_LED_ON = 1,
};

#define LED_MAX_BRIGHTNESS          127
#define LED_DEF_BRIGHTNESS          63
#define LED_MED_BRIGHTNESS          31

struct max77696_led_platform_data {
	struct led_info info;
	bool manual_mode;
	u8 sol_brightness;
};

struct max77696_backlight_platform_data {
};

/* Analog-to-Digital Converter */
#define MAX77696_ADC_NR_CHS  MAX77696_ADC_CH_MAX

enum {
    MAX77696_ADC_CH_VSYS2 = 0,
    MAX77696_ADC_CH_TDIE,
    MAX77696_ADC_CH_VSYS1,
    MAX77696_ADC_CH_VCHGINA,
    MAX77696_ADC_CH_ICHGINA,
    MAX77696_ADC_CH_IMONL1,
    MAX77696_ADC_CH_IMONL2,
    MAX77696_ADC_CH_IMONL3,
    MAX77696_ADC_CH_IMONL4,
    MAX77696_ADC_CH_IMONL5,
    MAX77696_ADC_CH_IMONL6,
    MAX77696_ADC_CH_IMONL7,
    MAX77696_ADC_CH_IMONL8,
    MAX77696_ADC_CH_IMONL9,
    MAX77696_ADC_CH_IMONL10,
    MAX77696_ADC_CH_IMONB1,
    MAX77696_ADC_CH_IMONB2,
    MAX77696_ADC_CH_IMONB3,
    MAX77696_ADC_CH_IMONB4,
    MAX77696_ADC_CH_IMONB5,
    MAX77696_ADC_CH_IMONB6,
    MAX77696_ADC_CH_AIN0,
    MAX77696_ADC_CH_AIN1,
    MAX77696_ADC_CH_AIN2,
    MAX77696_ADC_CH_AIN3,
    MAX77696_ADC_CH_MAX,
};

struct max77696_adc_platform_data {
	u8  avg_rate;  /* average rate: 1, 2, 16, 32 samples */
	u16 adc_delay; /* up to 16500 nano-seconds */
	u8  current_src; /* current source: 0, 5, 10, 50uA */
};

/* Gas guage */
#define MAX77696_GAUGE_POLLING_CAPACITY             BIT(15)
#define MAX77696_GAUGE_POLLING_TEMP                 BIT(14)
#define MAX77696_GAUGE_POLLING_VOLTAGE              BIT(13)
#define MAX77696_GAUGE_POLLING_CURRENT_AVG          BIT(12)
#define MAX77696_GAUGE_POLLING_NAC                  BIT(11)
#define MAX77696_GAUGE_POLLING_LMD                  BIT(10)
#define MAX77696_GAUGE_POLLING_CYCLE                BIT(9)
#define MAX77696_GAUGE_POLLING_NAC_AVG              BIT(8)
#define MAX77696_GAUGE_POLLING_NAC_MIX              BIT(7)
#define MAX77696_GAUGE_POLLING_CAPACITY_AVG         BIT(6)
#define MAX77696_GAUGE_POLLING_CAPACITY_MIX         BIT(5)
#define MAX77696_GAUGE_CHARACTERIZATION_DATA_SIZE   48

enum {
	MAX77696_GAUGE_LEARNED_FULLCAP = 0,
	MAX77696_GAUGE_LEARNED_CYCLES,
	MAX77696_GAUGE_LEARNED_RCOMP0,
	MAX77696_GAUGE_LEARNED_TEMPCO,
	MAX77696_GAUGE_LEARNED_QRESIDUAL00,
	MAX77696_GAUGE_LEARNED_QRESIDUAL10,
	MAX77696_GAUGE_LEARNED_QRESIDUAL20,
	MAX77696_GAUGE_LEARNED_QRESIDUAL30,
	MAX77696_GAUGE_LEARNED_DQACC,
	MAX77696_GAUGE_LEARNED_DPACC,

	MAX77696_GAUGE_LEARNED_NR_INFOS,
};

/*
 * used for setting a register to a desired value
 * addr : address for a register
 * data : setting value for the register
 */
struct max77696_gauge_reg_data {
	u8  addr;
	u16 data;
};

struct max77696_gauge_led_control {
	bool                manual_mode;
	enum led_brightness brightness;
	bool                flashing;
	struct {
		unsigned long duration_ms;
		unsigned long period_ms;
	} flash_params;
};

struct max77696_gauge_led_trigger {
	bool                              enable;
	struct max77696_gauge_led_control control[MAX77696_LED_NR_LEDS];
};

struct max77696_gauge_platform_data {
	/* The Alert Threshold values
	 *   - Over-/undervoltage       VALRT threshold violation (upper or lower)
	 *   - Over-/undertemperature   TALRT threshold violation (upper or lower)
	 *   - Over/under SOC           SALRT threshold violation (upper or lower)
	 * (the alert will be disabled if max and min are same)
	 */
	int                                v_alert_max, v_alert_min; /* 5100 ~    0 [mV] */
	int                                t_alert_max, t_alert_min; /*  127 ~ -128 [C] */
	int                                s_alert_max, s_alert_min; /*  255 ~    0 [%] */
	bool                               enable_alert_on_battery_removal;
	bool                               enable_alert_on_battery_insertion;
	bool                               enable_current_sense;
	bool                               enable_por_init;

	int                                charge_full_design;    /* in uAh */
	int                                battery_full_capacity; /* in percent */

	/*
	 * R_sns in micro-ohms.
	 * default 10000 (if r_sns = 0) as it is the recommended value by
	 * the datasheet although it can be changed by board designers.
	 */
	unsigned int                       r_sns;

	unsigned int                       update_interval_ms; /* in msec */
	unsigned int                       update_interval_relax_ms; /* in msec */
	/* ORed MAX77696_GAUGE_POLL_... */
	u16                                polling_properties;

	struct max77696_gauge_reg_data    *init_data;
	int                                num_init_data;

	struct max77696_gauge_led_trigger  default_trigger;
	struct max77696_gauge_led_trigger  charging_trigger;
	struct max77696_gauge_led_trigger  charging_full_trigger;

	bool                               (*battery_online) (void);
	bool                               (*charger_online) (void);
	bool                               (*charger_enable) (void);
};

struct max77696_gauge_config_data {
	/* A/D measurement */
	u16	tgain;		/* 0x2C */
	u16	toff;		/* 0x2D */
	u16	cgain;		/* 0x2E */
	u16	coff;		/* 0x2F */

	/* Alert / Status */
	u16	valrt_thresh;	/* 0x01 */
	u16	talrt_thresh;	/* 0x02 */
	u16	soc_alrt_thresh;	/* 0x03 */
	u16	config;		/* 0x01D */
	u16	shdntimer;	/* 0x03F */

	/* App data */
	u16	full_soc_thresh;	/* 0x13 */
	u16	design_cap;	/* 0x18 */
	u16	ichgt_term;	/* 0x1E */

	/* MG3 config */
	u16	at_rate;	/* 0x04 */
	u16	learn_cfg;	/* 0x28 */
	u16	filter_cfg;	/* 0x29 */
	u16	relax_cfg;	/* 0x2A */
	u16	misc_cfg;	/* 0x2B */
	u16	masksoc;	/* 0x32 */

	/* MG3 save and restore */
	u16	fullcap;	/* 0x10 */
	u16	fullcapnom;	/* 0x23 */
	u16	socempty;	/* 0x33 */
	u16	lavg_empty;	/* 0x36 */
	u16	dqacc;		/* 0x45 */
	u16	dpacc;		/* 0x46 */
	u16	qrtbl00;	/* 0x12 */
	u16	qrtbl10;	/* 0x22 */
	u16	qrtbl20;	/* 0x32 */
	u16	qrtbl30;	/* 0x42 */

	/* Cell Data */
	u16	vempty;		/* 0x12 */
	u16	temp_nom;	/* 0x24 */
	u16	temp_lim;	/* 0x25 */
	u16	fctc;		/* 0x37 */
	u16	rcomp0;		/* 0x38 */
	u16	tcompc0;	/* 0x39 */
	u16	empty_tempco;	/* 0x3A */
	u16	kempty0;	/* 0x3B */
	u16 cycles;
	u16 batt_cap;
	u16	cell_char_tbl[MAX77696_GAUGE_CHARACTERIZATION_DATA_SIZE];
} __packed;

/* USB Charger Detection */
#define MAX77696_UIC_CHGTYPE_USB             0b0001 /* USB Cable */
#define MAX77696_UIC_CHGTYPE_CDP             0b0010 /* Charging Downstream Port */
#define MAX77696_UIC_CHGTYPE_DEDICATED_1P5A  0b0011 /* Dedicated Charger: current 1500mA max */
#define MAX77696_UIC_CHGTYPE_APPLE_0P5AC     0b0100 /* Apple Charger: current  500mA max */
#define MAX77696_UIC_CHGTYPE_APPLE_1P0AC     0b0101 /* Apple Charger: current 1500mA max */
#define MAX77696_UIC_CHGTYPE_APPLE_2P0AC     0b0110 /* Apple Charger: current 2000mA max */
#define MAX77696_UIC_CHGTYPE_OTH_0           0b0111 /* Other Charger */
#define MAX77696_UIC_CHGTYPE_SELFENUM_0P5AC  0b1001 /* Self Enumerated: current 500mA max */
#define MAX77696_UIC_CHGTYPE_OTH_1           0b1100 /* Other Charger */

#define MAX77696_UIC_ISET_0mA                0b000
